app/controllers/ballots_controller.rb

  def index
    @ballots = Ballot.all
---
SELECT * FROM "ballots"