app/controllers/events_controller.rb

SELECT * FROM "events"
---
  def index
    @events = Event.all