app/controllers/groups_controller.rb

  def index
    @groups = Group.all
---
SELECT * FROM "groups"

    def find_group
      @group = Group.find(params[:id])
---
SELECT * FROM "groups" WHERE ("groups"."id" = 0)